tutorials/compressible/DBNS/explicitDBNSSolver/forwardStep/system/blockMeshDict
/*---------------------------------------------------------------------------*
Caelus 9.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices        
(
    (0 0 -0.05)
    (0.6 0 -0.05)
    (0 0.2 -0.05)
    (0.6 0.2 -0.05)
    (3 0.2 -0.05)
    (0 1 -0.05)
    (0.6 1 -0.05)
    (3 1 -0.05)
    (0 0 0.05)
    (0.6 0 0.05)
    (0 0.2 0.05)
    (0.6 0.2 0.05)
    (3 0.2 0.05)
    (0 1 0.05)
    (0.6 1 0.05)
    (3 1 0.05)
);

blocks          
(
    hex (0 1 3 2 8 9 11 10) (96 32 1) simpleGrading (1 1 1)
    hex (2 3 6 5 10 11 14 13) (96 128 1) simpleGrading (1 1 1)
    hex (3 4 7 6 11 12 15 14) (384 128 1) simpleGrading (1 1 1)
);

edges           
(
);

patches         
(
    patch inlet 
    (
        (0 8 10 2)
        (2 10 13 5)
    )
    patch outlet 
    (
        (4 7 15 12)
    )
    symmetryPlane bottom 
    (
        (0 1 9 8)
    )
    symmetryPlane top 
    (
        (5 13 14 6)
        (6 14 15 7)
    )
    patch obstacle
    (
        (1 3 11 9)
        (3 4 12 11)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
