tutorials/compressible/DBNS/explicitDBNSSolver/forwardStep/0/U
/*---------------------------------------------------------------------------*
Caelus 9.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (3 0 0);

boundaryField
{
    inlet           
    {
        type            fixedValue;
        value           uniform (3 0 0);
    }

    outlet          
    {
        type            zeroGradient;
    }

    bottom          
    {
        type            symmetryPlane;
    }

    top             
    {
        type            symmetryPlane;
    }

    obstacle
    {
        type            slip;
    }

    defaultFaces    
    {
        type            empty;
    }
}

// ************************************************************************* //
